In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('data/scientists.csv')

In [4]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [7]:
df[['Name','Age']]

                   Name  Age
0     Rosaline Franklin   37
1        William Gosset   61
2  Florence Nightingale   90
3           Marie Curie   66
4         Rachel Carson   56
5             John Snow   45
6           Alan Turing   41
7          Johann Gauss   77

In [8]:
df['Age'].mean()

59.125

In [9]:
# 평균 나이보다 나이가 많은 사람 추출

In [11]:
df['Age'].mean()<df['Age']

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [12]:
df['Age'].mean()<df['Age'].to_list()

array([False,  True,  True,  True, False, False, False,  True])

In [13]:
df[[False,  True,  True,  True, False, False, False,  True]]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [14]:
cond1 = df['Age'].mean()<df['Age']
df[cond1]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [17]:
df['Age'] + df['Age']

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [18]:
df['Age'] + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [19]:
df['Age'] + pd.Series([100,1])

0    137.0
1     62.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [22]:
print(df['Born'].dtype)

object

In [25]:
#1958-04-16
born_datetime = pd.to_datetime(df['Born'],format='%Y-%m-%d')
died_datetime = pd.to_datetime(df['Died'],format='%Y-%m-%d')

In [24]:
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [27]:
df['Born_dt'],df['Died_dt'] = (born_datetime,died_datetime)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   Born_dt     8 non-null      datetime64[ns]
 6   Died_dt     8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 580.0+ bytes

In [32]:
df['Born_dt']-df['Died_dt']

0   -13779 days
1   -22404 days
2   -32964 days
3   -24345 days
4   -20777 days
5   -16529 days
6   -15324 days
7   -28422 days
dtype: timedelta64[ns]

In [35]:
df['Born_dt'],df['Born_dt'] + pd.to_timedelta(365,'day')

(0   1920-07-25
 1   1876-06-13
 2   1820-05-12
 3   1867-11-07
 4   1907-05-27
 5   1813-03-15
 6   1912-06-23
 7   1777-04-30
 Name: Born_dt, dtype: datetime64[ns],
 0   1921-07-25
 1   1877-06-13
 2   1821-05-12
 3   1868-11-06
 4   1908-05-26
 5   1814-03-15
 6   1913-06-23
 7   1778-04-30
 Name: Born_dt, dtype: datetime64[ns])

In [37]:
df.drop(columns=['Born_dt','Died_dt'])

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [38]:
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [39]:
df.drop(columns=['Born_dt','Died_dt'],inplace=True)

In [40]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [42]:
type(born_datetime[0])

pandas._libs.tslibs.timestamps.Timestamp

In [46]:
# 날짜와 시간(datetime)을 문자열로 출력하려면 strftime
# 날짜와 시간 형식의 문자열을 datetime으로 변환하려면 strptime을 사용하면 된다.

import datetime
now = datetime.datetime.now()
print(now)

date = now.strftime('%d일%m월%Y년')
print(date)      # 2021-04-08
 
time = now.strftime('%H:%M:%S')
print(time)      # 21:28:20
 
datetime = now.strftime('%Y-%m-%d %H:%M:%S')
print(datetime)  # 2021-04-08 21:28:20

2023-10-20 15:31:27.622961
20일10월2023년
15:31:27
2023-10-20 15:31:27